# -*- eval: (setq org-media-note-screenshot-image-dir (concat default-directory "./static/Python 多核并行运算/")); -*-
:PROPERTIES:
:ID:       0D89BE89-D49A-4211-AD88-5D3049AFF378
:END:
#+LATEX_CLASS: my-article
#+DATE: <2021-04-18 Sun 20:24>
#+TITLE: Python 多核并行运算
** 顺序执行的单线程
 #+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :session :results output :exports no-eval
 from threading import Thread
 import time


 def my_counter():
     i = 0
     for _ in xrange(100000000):
         i = i + 1
     return True


 def main():
     start_time = time.time()
     for tid in range(2):
         t = Thread(target=my_counter)
         t.start()
         t.join()
     end_time = time.time()
     print("Total time: {}".format(end_time - start_time))


 if __name__ == "__main__":
     main()
 #+END_SRC

 #+RESULTS:
 : Total time: 7.30889415741

** 同时执行的两个并发线程
 #+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :session :results output :exports no-eval
   from threading import Thread
   import time


   def my_counter():
       i = 0
       for _ in xrange(100000000):
           i = i + 1
       return True


   def main():
       thread_array = {}
       start_time = time.time()
       for tid in range(2):
           t = Thread(target=my_counter)
           t.start()
           thread_array[tid] = t
       for i in range(2):
           thread_array[i].join()
       end_time = time.time()
       print("Total time: {}".format(end_time - start_time))


   if __name__ == "__main__":
       main()

 #+END_SRC

 #+RESULTS:
 : Total time: 11.5423491001

** Multiprocessing.Pool
 #+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :session :results output :exports no-eval
 # -*- coding:utf-8 -*-
 import multiprocessing
 import sys

 def f(x):
     return x * x


 cores = multiprocessing.cpu_count()
 pool = multiprocessing.Pool(processes=cores)
 xs = range(5)


 # Method 1: map
 print pool.map(func=f, iterable=xs)


 # Method 2: imap
 for y in pool.imap(func=f, iterable=xs):
     print y


 # Method 3: imap_unordered
 cnt = 0
 for _ in pool.imap_unordered(func=f, iterable=xs):
     sys.stdout.write("done %d/%d\r" % (cnt, len(xs)))
     cnt += 1
 #+END_SRC

 #+RESULTS:
 : [0, 1, 4, 9, 16]
 : 0
 : 1
 : 4
 : 9
 : 16
 : done 0/5done 1/5done 2/5done 3/5done 4/5

 # 使用 Theano 或者 Tensorflow 等工具时的注意事项
 需要注意的是， 在 import theano 或者 import tensorflow 等调用了 Cuda 的工具的时候会产生一些副作用， 这些副作用会原样拷贝到子进程中， 然后就发生错误， 如：
 解决的方法是， 保证父进程不引入这些工具， 而是在子进程创建好后， 让子进程各自引入。

